# Series

In [99]:
import numpy as np
import pandas as pd

In [100]:
labels = ['a', 'b', 'c']
a = np.array([10, 20, 30])
b = [{ 'a': 44 }, [], {}, False]
d = { 'a': 10, 'b':20, 'c': 30 }

In [101]:
print(pd.Series(a))
print('')
print(pd.Series(a, labels))
print('')
print(pd.Series(data=labels))
print('')
print(pd.Series(data=b))
print('')
print(pd.Series([sum, print, len]))
print('')
print(pd.Series(d))

0    10
1    20
2    30
dtype: int64

a    10
b    20
c    30
dtype: int64

0    a
1    b
2    c
dtype: object

0    {'a': 44}
1           []
2           {}
3        False
dtype: object

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

a    10
b    20
c    30
dtype: int64

In [102]:
s_1 = pd.Series({
    'goal1': 500,
    'goal2': 500,
    'goal3': 500,
    'goal4': 500
})
s_2 = pd.Series({
    'goal1': 500,
    'goal2': 500 
})

In [103]:
s_1 + s_2

goal1    1000.0
goal2    1000.0
goal3       NaN
goal4       NaN
dtype: float64

In [104]:
s_1 + s_2['goal2']

goal1    1000
goal2    1000
goal3    1000
goal4    1000
dtype: int64

# Dataframes

In [105]:
df = pd.DataFrame(
    data=np.random.randn(5,4),
    index=['A', 'B', 'C', 'D', 'E'],
    columns=['COL_1', 'COL_2', 'COL_3', 'COL_4']
)
df

      COL_1     COL_2     COL_3     COL_4
A  0.134023  0.491805 -0.789151  1.223743
B -0.557970 -0.504130 -1.590057  1.201554
C -1.838849  0.236674  1.056545  0.085328
D -0.675469  0.781554  1.068832 -1.575868
E -0.888411  0.856815 -1.836761  0.962595

In [106]:
df['COL_1']

A    0.134023
B   -0.557970
C   -1.838849
D   -0.675469
E   -0.888411
Name: COL_1, dtype: float64

In [107]:
df[['COL_1', 'COL_2']]['COL_1']['A']

0.13402262132802317

In [108]:
df[['COL_1', 'COL_2']]

      COL_1     COL_2
A  0.134023  0.491805
B -0.557970 -0.504130
C -1.838849  0.236674
D -0.675469  0.781554
E -0.888411  0.856815

In [109]:
df['new'] = df['COL_2'] + df['COL_4']

In [110]:
df

      COL_1     COL_2     COL_3     COL_4       new
A  0.134023  0.491805 -0.789151  1.223743  1.715548
B -0.557970 -0.504130 -1.590057  1.201554  0.697424
C -1.838849  0.236674  1.056545  0.085328  0.322002
D -0.675469  0.781554  1.068832 -1.575868 -0.794314
E -0.888411  0.856815 -1.836761  0.962595  1.819410

In [111]:
df.drop('new', axis=1, inplace=True) # operation is not in-place

In [112]:
df.drop('A', inplace=False) # operation is not in-place

      COL_1     COL_2     COL_3     COL_4
B -0.557970 -0.504130 -1.590057  1.201554
C -1.838849  0.236674  1.056545  0.085328
D -0.675469  0.781554  1.068832 -1.575868
E -0.888411  0.856815 -1.836761  0.962595

In [113]:
df

      COL_1     COL_2     COL_3     COL_4
A  0.134023  0.491805 -0.789151  1.223743
B -0.557970 -0.504130 -1.590057  1.201554
C -1.838849  0.236674  1.056545  0.085328
D -0.675469  0.781554  1.068832 -1.575868
E -0.888411  0.856815 -1.836761  0.962595

In [114]:
df.shape

(5, 4)

## selecting rows

In [115]:
df.loc['A']

COL_1    0.134023
COL_2    0.491805
COL_3   -0.789151
COL_4    1.223743
Name: A, dtype: float64

In [116]:
df.iloc[2]

COL_1   -1.838849
COL_2    0.236674
COL_3    1.056545
COL_4    0.085328
Name: C, dtype: float64

In [117]:
df.loc['A', 'COL_2'] == df.loc['A']['COL_2']

True

In [118]:
df.loc[['A', 'B']][['COL_1', 'COL_2']]

      COL_1     COL_2
A  0.134023  0.491805
B -0.557970 -0.504130

# conditional selection

In [119]:
df > 0

   COL_1  COL_2  COL_3  COL_4
A   True   True  False   True
B  False  False  False   True
C  False   True   True   True
D  False   True   True  False
E  False   True  False   True

In [120]:
df[df > 0]

      COL_1     COL_2     COL_3     COL_4
A  0.134023  0.491805       NaN  1.223743
B       NaN       NaN       NaN  1.201554
C       NaN  0.236674  1.056545  0.085328
D       NaN  0.781554  1.068832       NaN
E       NaN  0.856815       NaN  0.962595

In [122]:
# df[df['COL_1'] > 0]['COL_3'].loc['D']

In [123]:
df[(df['COL_1'] > 0) | (df['COL_2'] < 0)]

      COL_1     COL_2     COL_3     COL_4
A  0.134023  0.491805 -0.789151  1.223743
B -0.557970 -0.504130 -1.590057  1.201554

In [124]:
df[(df['COL_1'] > 0) & (df['COL_2'] > 0)]

      COL_1     COL_2     COL_3     COL_4
A  0.134023  0.491805 -0.789151  1.223743

In [125]:
df.reset_index()

  index     COL_1     COL_2     COL_3     COL_4
0     A  0.134023  0.491805 -0.789151  1.223743
1     B -0.557970 -0.504130 -1.590057  1.201554
2     C -1.838849  0.236674  1.056545  0.085328
3     D -0.675469  0.781554  1.068832 -1.575868
4     E -0.888411  0.856815 -1.836761  0.962595

In [126]:
new_ind = ['row_1', 'row_2', 'row_3', 'row_4', 'row_5']

In [127]:
df['new_ind_col'] = new_ind

In [128]:
df.set_index('new_ind_col', inplace=True)

In [129]:
df

                COL_1     COL_2     COL_3     COL_4
new_ind_col
row_1        0.134023  0.491805 -0.789151  1.223743
row_2       -0.557970 -0.504130 -1.590057  1.201554
row_3       -1.838849  0.236674  1.056545  0.085328
row_4       -0.675469  0.781554  1.068832 -1.575868
row_5       -0.888411  0.856815 -1.836761  0.962595

In [130]:
df.loc[['row_1', 'row_2']]

                COL_1     COL_2     COL_3     COL_4
new_ind_col
row_1        0.134023  0.491805 -0.789151  1.223743
row_2       -0.557970 -0.504130 -1.590057  1.201554

# Multi-index

In [131]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [132]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [133]:
df = pd.DataFrame(
    np.random.randn(6, 2), 
    hier_index,
    ['COL_1', 'COL_2']
)

In [134]:
df

         COL_1     COL_2
G1 1  0.415162  2.082627
   2  0.890026 -0.901073
   3  0.295745  0.581138
G2 1 -1.080889  0.229732
   2 -1.179220 -1.629502
   3 -1.766025  1.440483

In [135]:
df.loc['G1']

      COL_1     COL_2
1  0.415162  2.082627
2  0.890026 -0.901073
3  0.295745  0.581138

In [136]:
df.index.names = ['Outer', 'Inner']

In [137]:
df

                COL_1     COL_2
Outer Inner
G1    1      0.415162  2.082627
      2      0.890026 -0.901073
      3      0.295745  0.581138
G2    1     -1.080889  0.229732
      2     -1.179220 -1.629502
      3     -1.766025  1.440483

In [138]:
df.loc['G2'].loc[1]['COL_2']

0.22973151422324364

In [139]:
df.xs('G1')

          COL_1     COL_2
Inner
1      0.415162  2.082627
2      0.890026 -0.901073
3      0.295745  0.581138

### multi-index cross section

In [140]:
df.xs(1, level='Inner')

          COL_1     COL_2
Outer
G1     0.415162  2.082627
G2    -1.080889  0.229732

# Missing data

In [171]:
d = {
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
}

In [172]:
df = pd.DataFrame(d)

In [173]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [174]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [175]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [176]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [177]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [178]:
df.fillna('YOOOOOO')

         A        B  C
0        1        5  1
1        2  YOOOOOO  2
2  YOOOOOO  YOOOOOO  3

In [179]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [180]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [181]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [184]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

# Group by

In [189]:
d = {
    'Company': ['DBS', 'DBS', 'SCB', 'SCB', 'UOB', 'UOB'],
    'Person': ['Alexander', 'Benjamin', 'Charlie', 'David', 'Eugene', 'Francois'],
    'Sales': [200, 120, 340, 214, 243, 500]        
}

In [190]:
df = pd.DataFrame(d)

In [191]:
df

  Company     Person  Sales
0     DBS  Alexander    200
1     DBS   Benjamin    120
2     SCB    Charlie    340
3     SCB      David    214
4     UOB     Eugene    243
5     UOB   Francois    500

In [195]:
df.groupby('Company').mean()

         Sales
Company
DBS      160.0
SCB      277.0
UOB      371.5

In [198]:
df.groupby('Company').std().loc['DBS']

Sales    56.568542
Name: DBS, dtype: float64

In [201]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
DBS       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
SCB       2.0  277.0   89.095454  214.0  245.50  277.0  308.50  340.0
UOB       2.0  371.5  181.726443  243.0  307.25  371.5  435.75  500.0

In [204]:
df.groupby('Company').describe().transpose()

Company             DBS         SCB         UOB
Sales count    2.000000    2.000000    2.000000
      mean   160.000000  277.000000  371.500000
      std     56.568542   89.095454  181.726443
      min    120.000000  214.000000  243.000000
      25%    140.000000  245.500000  307.250000
      50%    160.000000  277.000000  371.500000
      75%    180.000000  308.500000  435.750000
      max    200.000000  340.000000  500.000000

# Merge, join, concat

In [211]:
df1 = pd.DataFrame(
    {
        'A': ['AO', 'A1', 'A2', 'A3'],
        'B': ['BO', 'B1', 'B2', 'B3'],
        'C': ['CO', 'C1', 'C2', 'C3'],
        'D': ['DO', 'D1', 'D2', 'D3']
    },
    index=[0, 1, 2, 3]
)

In [212]:
df2 = pd.DataFrame(
    {
        'A': ['A4', 'A5', 'A6', 'A7'],
        'B': ['B4', 'B5', 'B6', 'B7'],
        'C': ['C4', 'C5', 'C6', 'C7'],
        'D': ['D4', 'D5', 'D6', 'D7']
    },
    index=[4, 5, 6, 7]
)

In [213]:
df3 = pd.DataFrame(
    {
        'A': ['A8', 'A9', 'A10', 'A11'],
        'B': ['B8', 'B9', 'B10', 'B11'],
        'C': ['C8', 'C9', 'C10', 'C11'],
        'D': ['D8', 'D9', 'D10', 'D11']
    },
    index=[8, 9, 10, 11]
)

In [216]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    AO   BO   CO   DO
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [218]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    AO   BO   CO   DO  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [236]:
left = pd.DataFrame({
    'key1': ['K0', 'K1', 'K2', 'K3'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

In [237]:
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K2', 'K3'],
    'key2': ['KO', 'KO', 'KO', 'KO'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']  
})

In [238]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K3   K1  A3  B3

In [239]:
right

  key1 key2   C   D
0   K0   KO  C0  D0
1   K1   KO  C1  D1
2   K2   KO  C2  D2
3   K3   KO  C3  D3

In [243]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   KO  NaN  NaN  C0  D0
1   K1   KO  NaN  NaN  C1  D1
2   K2   KO  NaN  NaN  C2  D2
3   K3   KO  NaN  NaN  C3  D3

## join

In [247]:
left = pd.DataFrame(
    {
        'A': ['A0', 'A1', 'A2'],
        'B': ['B0', 'B1', 'B2']
    },
    index=['K0', 'K1', 'K2']
)

In [248]:
right = pd.DataFrame(
    {
        'C': ['C0', 'C1', 'C2'],
        'D': ['D0', 'D1', 'D2']
    },
    index=['K0', 'K1', 'K2']
)

In [249]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [250]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [251]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [254]:
left.join(right, how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

# common operations

In [262]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 555],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})

In [263]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   555  xyz

In [273]:
len(df['col2'].unique()) == df['col2'].nunique()

True

In [274]:
df['col2'].value_counts()

555    2
666    1
444    1
Name: col2, dtype: int64

In [281]:
df[(df['col1'] > 2) & (df['col2'] == 555)]

   col1  col2 col3
3     4   555  xyz

In [282]:
def times2(x):
    return x * 2

In [283]:
df['col1'].sum()

10

In [284]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [285]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [286]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8  1110  xyzxyz

In [287]:
df.apply(lambda x: x *2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8  1110  xyzxyz

In [291]:
df.drop('col1', axis=1, inplace=False)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   555  xyz

In [292]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [293]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [296]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
3     4   555  xyz
2     3   666  ghi

In [297]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [300]:
d = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}
df = pd.DataFrame(d)

In [301]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### "pivot tables"

In [305]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and output

In [308]:
pwd

'/home/klagrange/Repositories/anaconda-quickies'